reedy/ESP32-RevK/settings_lib.c
static const char *
load_value (revk_settings_t * s, const char *d, int index, void *ptr)
{                               // Puts value in memory (or at ptr if set)
   if (!ptr)
      ptr = s->ptr;
   else
      index = 0;
   if (index > 0)
      ptr += index * (s->malloc ? sizeof (void *) : s->size);
   const char *err = NULL;
   int a = s->array;
   const char *e = NULL;
   char *mem = NULL;
   if (d)
   {
      e = d + strlen (d);
      if (s->dq && e > d + 1 && *d == '"' && e[-1] == '"')
      {
         d++;
         e--;
      }
      if (d == e)
         d = e = NULL;
   }
   if (d < e && (s->hex || s->base64)
#ifdef	REVK_SETTINGS_HAS_NUMERIC
#ifdef  REVK_SETTINGS_HAS_SIGNED
       && s->type != REVK_SETTINGS_SIGNED
#endif
#ifdef  REVK_SETTINGS_HAS_UNSIGNED
       && s->type != REVK_SETTINGS_UNSIGNED
#endif
#endif
      )
   {
      jo_t j = jo_create_alloc ();
      jo_stringn (j, NULL, d, e - d);
      jo_rewind (j);
      ssize_t len = jo_strncpyd (j, NULL, 0, s->base64 ? 6 : 4, s->base64 ? JO_BASE64 : JO_BASE16);
      if (len <= 0)
         err = s->base64 ? "Bad base64" : "Bad hex";
      if (err)
         d = e = NULL;
      else
      {
         mem = mallocspi (len);
         jo_strncpyd (j, mem, len, s->base64 ? 6 : 4, s->base64 ? JO_BASE64 : JO_BASE16);
         d = mem;
         e = mem + len;
      }
      jo_free (&j);
   }
   switch (s->type)
   {
#ifdef	REVK_SETTINGS_HAS_NUMERIC
#ifdef  REVK_SETTINGS_HAS_SIGNED
   case REVK_SETTINGS_SIGNED:
#endif
#ifdef  REVK_SETTINGS_HAS_UNSIGNED
   case REVK_SETTINGS_UNSIGNED:
#endif
      if (s->malloc)
         err = "Malloc number not supported";
      else
      {
         err = parse_numeric (s, &ptr, &d, e);
         if (a && index < 0)
            while (!err && --a)
               err = parse_numeric (s, &ptr, &d, e);
         if (!err && d < e)
            err = "Extra data on end of number";
      }
      break;
#endif
#ifdef  REVK_SETTINGS_HAS_BIT
   case REVK_SETTINGS_BIT:
      if (s->malloc)
         err = "Malloc bit not supported";
      else
      {
         uint8_t b = ((d < e && (*d == '1' || *d == 't' || *d == 'o')) ? 1 : 0);
         if (ptr)
            *(uint8_t *) ptr = b;
         else
         {
            if (b)
               ((uint8_t *) & revk_settings_bits)[s->bit / 8] |= (1 << (s->bit & 7));
            else
               ((uint8_t *) & revk_settings_bits)[s->bit / 8] &= ~(1 << (s->bit & 7));
         }
      }
      break;
#endif
#ifdef  REVK_SETTINGS_HAS_BLOB
   case REVK_SETTINGS_BLOB:
      if (!s->malloc)
         err = "Fixed blob not supported";
      else
      {
         void **p = (void **) ptr;
         free (*p);
         if (d < e)
         {
            *p = mallocspi (sizeof (revk_settings_blob_t) + e - d);
            ((revk_settings_blob_t *) (*p))->len = (e - d);
            memcpy ((*p) + sizeof (revk_settings_blob_t), d, e - d);
         } else
         {
            *p = mallocspi (sizeof (revk_settings_blob_t));
            ((revk_settings_blob_t *) (*p))->len = 0;
         }
         if (a && index < 0)
            while (--a)
            {
               p++;
               free (*p);
               *p = mallocspi (sizeof (revk_settings_blob_t));
               ((revk_settings_blob_t *) (*p))->len = 0;
            }
      }
      break;
#endif
#ifdef  REVK_SETTINGS_HAS_STRING
   case REVK_SETTINGS_STRING:
      {
         if (!s->malloc)
         {                      // Fixed
            if (e - d + 1 > s->size)
               err = "Too long";
            else
            {
               memcpy (ptr, d, e - d);
               ((char *) ptr)[e - d] = 0;
            }
            if (a && index < 0)
               while (--a)
               {
                  ptr += s->size;
                  memset (ptr, 0, s->size);
               }
         } else
         {                      // Malloc
            void **p = (void **) ptr;
            free (*p);
            if (d)
               *p = strndup (d, (int) (e - d));
            else
               *p = strdup ("");
            if (a && index < 0)
               while (--a)
               {
                  p++;
                  free (*p);
                  *p = strdup ("");
               }
         }
      }
      break;
#endif
#ifdef  REVK_SETTINGS_HAS_OCTET
   case REVK_SETTINGS_OCTET:
      if (s->malloc)
         err = "Malloc octet not supported";
      else
      {
         if (d < e)
         {
            if (e - d != s->size)
               err = "Wrong length";
            else
               memcpy (ptr, d, e - d);
         } else
            memset (ptr, 0, s->size);
         if (a && index < 0)
            while (--a)
            {
               memset (ptr, 0, s->size);
               ptr += s->size;
            }
      }
      break;
#endif
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
   default:
      ESP_LOGE (TAG, "Bad type %s %d", s->name, s->type);
#endif
   }
   free (mem);
   return err;
}

void
revk_settings_load (const char *tag, const char *appname)
{                               // Scan NVS to load values to settings
   for (revk_settings_t * s = revk_settings; s->len; s++)
      load_value (s, s->def, -1, NULL);
   // Scan
   for (int revk = 0; revk < 2; revk++)
   {
      struct zap_s
      {
         struct zap_s *next;
         revk_settings_t *s;
         int index;
         char tag[0];
      } *zap = NULL;
      const char *part = revk ? tag : "nvs";
      const char *ns = revk ? tag : appname;
      if (!nvs_open_from_partition (part, ns, NVS_READWRITE, &nvs[revk]))
      {
         nvs_iterator_t i = NULL;
         if (!nvs_entry_find_compat (part, ns, NVS_TYPE_ANY, &i))
         {
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
            ESP_LOGE (TAG, "Scan %s/%s", part, ns);
#endif
            do
            {
               nvs_entry_info_t info = { 0 };
               void addzap (revk_settings_t * s, int index)
               {
                  struct zap_s *z = malloc (sizeof (*z) + strlen (info.key) + 1);
                  strcpy ((char *) z->tag, info.key);
                  z->next = zap;
                  z->s = s;
                  z->index = index;
                  zap = z;
               }
               if (nvs_entry_info_compat (i, &info))
                  continue;     // ?;
               const char *err = NULL;
               int l = strlen (info.key);
               int index = 0;
               revk_settings_t *s;
               for (s = revk_settings; s->len && !(s->revk == revk && !s->array && s->len == l && !memcmp (s->name, info.key, l));
                    s++);
               if (s->len)
                  err = nvs_get (s, info.key, 0);       // Exact match
               else
               {
                  for (s = revk_settings;
                       s->len && !(s->revk == revk && s->array && s->len + 1 == l && !memcmp (s->name, info.key, s->len)
                                   && (info.key[s->len] & 0x80)); s++);
                  if (s->len)
                     err = nvs_get (s, info.key, index = info.key[s->len] - 0x80);      // Array match, new
                  else
                  {
                     for (s = revk_settings;
                          s->len && !(s->revk == revk && s->array && s->len < l && !memcmp (s->name, info.key, s->len)
                                      && isdigit ((int) info.key[s->len])); s++);
                     if (s->len)
                     {          // Array match, old
                        index = atoi (info.key + s->len) - 1;
                        if (index >= 0 && index < s->array)
                        {
                           err = nvs_get (s, info.key, atoi (info.key + s->len) - 1);
                           addzap (s, index);
                        } else
                           addzap (NULL, 0);
                     } else
                     {
#ifdef	CONFIG_REVK_SETTINGS_HAS_OLD
                        for (s = revk_settings;
                             s->len && !(s->revk == revk && s->old && !s->array && !strcmp (s->old, info.key)); s++);
                        if (s->len)
                           err = nvs_get (s, info.key, 0);      // Exact match (old)
                        else
#endif
                        {
                           addzap (NULL, 0);    // Not doing old array or old style array - can add if needed
                           err = "Not matched";
                        }
                     }
                  }
               }
               if (err)
               {
                  ESP_LOGE (TAG, "NVS %s/%s/%s(%d): %s", part, ns, info.key, info.type, err);
                  addzap (s, index);
               }
            }
            while (!nvs_entry_next_compat (&i));
         }
         nvs_release_iterator (i);
      }
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
      else
         ESP_LOGE (TAG, "Failed NVS %s/%s", part, ns);
#endif
      for (struct zap_s * z = zap; z; z = z->next)
      {
         if (nvs_erase_key (nvs[revk], z->tag))
            ESP_LOGE (tag, "Erase %s failed", z->tag);
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
         else
            ESP_LOGE (TAG, "Erase %s", z->tag);
#endif
         if (z->s && z->s->len)
         {
            const char *err = nvs_put (z->s, z->index, NULL);
            if (err)
               ESP_LOGE (TAG, "%s failed: %s", z->s->name, err);
         }
      }
      while (zap)
      {
         struct zap_s *z = zap->next;
         free (zap);
         zap = z;
      }
   }
   for (revk_settings_t * s = revk_settings; s->len; s++)
      if (s->fix && !(nvs_found[(s - revk_settings) / 8] & (1 << ((s - revk_settings) & 7))))
      {                         // Fix, save to flash
         if (!s->array)
            nvs_put (s, 0, NULL);
         else
            for (int i = 0; i < s->array; i++)
               nvs_put (s, i, NULL);
      }
}

