reedy/ESP32-RevK/settings_lib.c
const char *
revk_setting_dump (int level)
{
   // level 1 - all stored
   // level 2 - all stored or with default
   // level 3 - all
   int is_zero (revk_settings_t * s, int index)
   {
#ifdef  REVK_SETTINGS_HAS_BIT
      if (s->type == REVK_SETTINGS_BIT && !(((uint8_t *) & revk_settings_bits)[s->bit / 8] & (1 << (s->bit & 7))))
         return 1;
#endif
      uint8_t *d = s->ptr;
      if (s->malloc)
      {
         void **p = s->ptr;
         p += index;
         d = (*p);
         if (!d)
            return 1;
      } else
         d += index * s->size;
      if (s->size)
      {
         int i;
         for (i = 0; i < s->size && !d[i]; i++);
         return i == s->size;
      }
      switch (s->type)
      {
#ifdef  REVK_SETTINGS_HAS_BLOB
      case REVK_SETTINGS_BLOB:
         return ((revk_settings_blob_t *) (d))->len == 0;
#endif
#ifdef  REVK_SETTINGS_HAS_STRING
      case REVK_SETTINGS_STRING:
         return *d == 0;
#endif
      }
      return 0;
   }
   int visible (revk_settings_t * s)
   {
      if (s->secret && (!*revk_settings_secret || level <= 2))
         return 0;              // We don't actually show the secret anyway
      if (level > 2)
         return 1;
      if (level <= 1 && !s->array && s->fix && (!s->def || !*s->def || (s->dq && !strcmp (s->def, "\"\""))) && is_zero (s, 0))
         return 0;
      if (nvs_found[(s - revk_settings) / 8] & (1 << ((s - revk_settings) & 7)))
         return 1;
      if (level > 1 && !s->array && !(!s->def || !*s->def || (s->dq && !strcmp (s->def, "\"\""))))
         return 1;
      return 0;
   }
   const char *err = NULL;
   jo_t j = NULL;
   void send (void)
   {                            // Sends the settings - this deliberately uses the revk_id not the hostname as it is "seen" by any device listening
      if (!j)
         return;
      const char *an = appname,
         *sl = "/";
      if (!prefixapp)
         an = sl = "";
      char *topic = NULL;
      asprintf (&topic, "%s%s%s/%s%s", prefixsetting, sl, an, revk_id, level <= 1 ? "" : "/+");
      revk_mqtt_send (NULL, 0, topic, &j);
      free (topic);
   }
   int maxpacket = MQTT_MAX;
   maxpacket -= 50;             // for headers
#ifdef	CONFIG_REVK_MESH
   maxpacket -= MESH_PAD;
#endif
   char *buf = mallocspi (maxpacket);   // Allows for topic, header, etc
   if (!buf)
      return "malloc";
   revk_setting_group_t group = { 0 };
   for (revk_settings_t * s = revk_settings; s->len; s++)
   {
      if (s->group && (group[s->group / 8] & (1 << (s->group & 7))))
         continue;              // Already done
      jo_t p = NULL;
      void start (void)
      {
         if (!p)
         {
            if (j)
               p = jo_copy (j);
            else
            {
               p = jo_create_mem (buf, maxpacket);
               jo_object (p, NULL);
            }
         }
      }
      const char *failed (void)
      {
         err = NULL;
         if (p && (err = jo_error (p, NULL)))
            jo_free (&p);       // Did not fit
         return err;
      }

      void addvalue (revk_settings_t * s, int index, const char *tag)
      {
         if (!s->array && !visible (s))
            return;             // Default
         int len = 0;
         char *data = revk_settings_text (s, index, &len);
         switch (s->type)
         {
#ifdef  REVK_SETTINGS_HAS_BIT
         case REVK_SETTINGS_BIT:
            jo_lit (p, tag, data);
            break;
#endif
#ifdef  REVK_SETTINGS_HAS_NUMERIC
#ifdef  REVK_SETTINGS_HAS_SIGNED
         case REVK_SETTINGS_SIGNED:
#endif
#ifdef  REVK_SETTINGS_HAS_UNSIGNED
         case REVK_SETTINGS_UNSIGNED:
#endif
            if (len)
            {
               char *d = data;
               if (*d == '-')
                  d++;
               if (isdigit ((int) *d))
               {
                  while (isdigit ((int) *d))
                     d++;
                  if (*d == '.')
                  {
                     d++;
                     while (isdigit ((int) *d))
                        d++;
                  }
               }
               if (!*d && strcmp (data, "-0"))
               {
                  jo_lit (p, tag, data);
                  break;
               }
            }
            jo_stringn (p, tag, data ? : "", len);
            break;
#endif
         default:
            if (s->hex)
               jo_base16 (p, tag, data ? : "", len);
            else if (s->base64)
               jo_base64 (p, tag, data ? : "", len);
            else
               jo_stringn (p, tag, data ? : "", len);
         }
         free (data);
      }

      void addarray (revk_settings_t * s, int base)
      {
         if (!visible (s))
            return;             // Default
         int max = s->array;
         if (level < 3)
            while (max > 0 && is_zero (s, max - 1))
               max--;
         if (max || level > 1 || !s->fix || !(!s->def || !*s->def || (s->dq && !strcmp (s->def, "\"\""))))
         {
            jo_array (p, s->name + base);
            for (int i = 0; i < max; i++)
               addvalue (s, i, NULL);
            jo_close (p);
         }
      }

      void addgroup (revk_settings_t * s)
      {
         group[s->group / 8] |= (1 << (s->group & 7));
         revk_settings_t *r;
         for (r = revk_settings; r->len && (r->group != s->group || !visible (r)); r++);
         if (!r->len)
            return;
         char tag[16];
         if (s->dot + 1 > sizeof (tag))
            return;
         strcpy (tag, s->name);
         tag[s->dot] = 0;
         jo_object (p, tag);
         for (r = revk_settings; r->len; r++)
            if (r->group == s->group && visible (r))
            {
               if (r->array)
                  addarray (r, r->dot);
               else
                  addvalue (r, 0, r->name + r->dot);
            }
         jo_close (p);
      }

      void addsetting (void)
      {                         // Add a whole setting
         start ();
         if (s->group)
            addgroup (s);
         else if (s->array)
            addarray (s, 0);
         else
            addvalue (s, 0, s->name);
      }

      addsetting ();
      if (failed () && j)
      {
         send ();               // Failed, clear what we were sending and try again
         addsetting ();
      }
      if (!failed ())
      {                         // Fitted, move forward
         if (p)
         {
            jo_free (&j);
            j = p;
         }
      } else
      {
         jo_t j = jo_make (NULL);
         jo_string (j, "description", "Setting did not fit");
         jo_string (j, prefixsetting, s->name);
         if (err)
            jo_string (j, "reason", err);
         revk_error (TAG, &j);
      }
   }
   send ();
   free (buf);
   return NULL;
}

