reedy/ESP32-RevK/settings_lib.c
const char *
revk_settings_store (jo_t j, const char **locationp, char passok)
{
   if (!j)
      return NULL;
   jo_rewind (j);
   jo_type_t t;
   if ((t = jo_here (j)) != JO_OBJECT)
      return "Not an object";
#ifdef  CONFIG_REVK_SETTINGS_PASSWORD
   if (!*password)
      passok = 1;
#endif
   char change = 0;
   char reload = 0;
   const char *err = NULL;
   char tag[16];
   revk_setting_bits_t found = { 0 };
   const char *location = NULL;
   char *bitused = mallocspi (sizeof (revk_settings_bits));
   if (!bitused)
      return "malloc";
   memset (bitused, 0, sizeof (revk_settings_bits));
   const char *scan (int plen, int pindex)
   {
      while (!err && (t = jo_next (j)) == JO_TAG)
      {
         location = jo_debug (j);
         int l = jo_strlen (j);
         if (l + plen > sizeof (tag) - 1)
            return "Too long";
         jo_strncpy (j, tag + plen, l + 1);
         revk_settings_t *s;
         for (s = revk_settings; s->len && (s->len != plen + l || (plen && s->dot != plen) || strcmp (s->name, tag)); s++);
         const char *store (int index)
         {
            if (!s->len)
            {
               if (index < 0)
               {
                  int e = l;
                  while (e && isdigit ((int) tag[plen + e - 1]))
                     e--;
                  if (e < l)
                  {
                     for (s = revk_settings;
                          s->len && (!s->array || s->len != plen + e || (plen && s->dot != plen)
                                     || strncmp (s->name, tag, plen + e)); s++);
                     if (s)
                        index = atoi (tag + plen + e) - 1;
                  }
               }
               if (!s->len)
                  return "Not found index";
            }
            if (index < 0)
               index = 0;
#ifdef	REVK_SETTINGS_HAS_BIT
            if (s->type == REVK_SETTINGS_BIT)
            {                   // De-dup bit (to allow for checkbox usage with secondary hidden)
               if (bitused[s->bit / 8] & (1 << (s->bit & 7)))
                  return NULL;  // Duplicate bit
               bitused[s->bit / 8] |= (1 << (s->bit & 7));
            }
#endif
            found[(s - revk_settings) / 8] |= (1 << ((s - revk_settings) & 7));
            if ((s->array && (index < 0 || index >= s->array)) || (!s->array && index))
               return "Bad array index";
            char *val = NULL;
            if (t == JO_NULL)
            {                   // Default
               if (s->def)
               {
                  val = (char *) s->def;
#ifdef	REVK_SETTINGS_HAS_NUMERIC
                  if (s->array && (0
#ifdef	REVK_SETTINGS_HAS_SIGNED
                                   || s->type == REVK_SETTINGS_SIGNED
#endif
#ifdef	REVK_SETTINGS_HAS_UNSIGNED
                                   || s->type == REVK_SETTINGS_UNSIGNED
#endif
                      ))
                  {             // Skip to the entry
                     if (s->dq && *val == '"')
                        val++;
                     int i = index;
                     while (i--)
                     {
                        while (*val && *val != ',' && *val != ' ' && *val != '\t')
                           val++;
                        while (*val && *val == ' ')
                           val++;
                        if (*val && (*val == ',' || *val == '\t'))
                           val++;
                        while (*val && *val == ' ')
                           val++;
                     }
                  }
#endif
                  val = strdup (val);
#ifdef	REVK_SETTINGS_HAS_NUMERIC
                  if (s->array && (0
#ifdef	REVK_SETTINGS_HAS_SIGNED
                                   || s->type == REVK_SETTINGS_SIGNED
#endif
#ifdef	REVK_SETTINGS_HAS_UNSIGNED
                                   || s->type == REVK_SETTINGS_UNSIGNED
#endif
                      ))
                  {
                     char *v = val;
                     while (*v && *v != ' ' && *v != ',' && *v != '\t' && (s->dq && *v != '"'))
                        v++;
                     *v = 0;
                  }
#endif
               }
            } else if (t != JO_CLOSE)
               val = jo_strdup (j);
            int len = s->malloc ? sizeof (void *) : s->size ? : 1;
            uint8_t *temp = mallocspi (len);
            if (!temp)
               err = "malloc";
            else
            {
               memset (temp, 0, len);
               uint8_t dofree = s->malloc;
               uint8_t bit = 0;
               void *ptr = s->ptr ? : &bit;
#ifdef	REVK_SETTINGS_HAS_BIT
               if (s->type == REVK_SETTINGS_BIT)
                  bit = ((((uint8_t *) & revk_settings_bits)[s->bit / 8] & (1 << (s->bit & 7))) ? 1 : 0);
               else
#endif
                  ptr += index * (s->malloc ? sizeof (void *) : s->size);
               if (s->secret && *revk_settings_secret && val && !strcmp (val, revk_settings_secret)
                   && (!s->malloc || s->type != REVK_SETTINGS_STRING || !*(char **) ptr || **((char **) ptr)))
               {                // Secret is dummy, unless current value is empty string in which case dummy value is allowed
                  free (val);
                  free (temp);
                  return NULL;
               }
               err = load_value (s, val, index, temp);
               if (!err)
               {
                  if (t == JO_NULL && !s->fix)
                  {             // Set to default, so erase - could still be a change of value (to default) so continue to compare
                     if (nvs_found[(s - revk_settings) / 8] & (1 << ((s - revk_settings) & 7)))
                     {
                        if (s->array)
                        {
                           char tag[20];
                           sprintf (tag, "%s%c", s->name, index + 0x80);
                           err = nvs_erase (s, tag);
                        } else
                           err = nvs_erase (s, s->name);
                     }
                  }
                  if (value_cmp (s, ptr, temp))
                  {             // Changed value, so store
                     if (s->live)
                     {          // Apply live
#ifdef	REVK_SETTINGS_HAS_BIT
                        if (s->type == REVK_SETTINGS_BIT)
                        {
                           if (*temp)
                              ((uint8_t *) & revk_settings_bits)[s->bit / 8] |= (1 << (s->bit & 7));
                           else
                              ((uint8_t *) & revk_settings_bits)[s->bit / 8] &= ~(1 << (s->bit & 7));
                        } else
#endif
                        {
                           if (s->malloc)
                              free (*(void **) ptr);
                           memcpy (ptr, temp, len);
                           dofree = 0;
                        }
                     }
                     if (t != JO_NULL || s->fix)
                        err = nvs_put (s, index, temp); // Put in NVS
                     if (!err)
                     {
                        change = 1;
                        if (!s->live)
                           reload = 1;
                     }
                  }
               }
               if (dofree)
                  free (*(void **) temp);
               free (temp);
            }
            free (val);
            return err;
         }
         t = jo_next (j);
#ifdef  CONFIG_REVK_SETTINGS_PASSWORD
         if (!passok && s->ptr == &password)
         {
            char *val = jo_strdup (j);
            if (!val || !*val)
               err = "Specify password";
            else if (!strcmp (val, password))
               passok = 1;
            else
               err = "Wrong password";
            free (val);
         }
         if (!err && !passok)
            err = "Password required to change settings";
         if (err)
         {
            location = NULL;
            return err;
         }
#endif
         if (*tag == '_')
            continue;
         void zapdef (void)
         {
            if (pindex >= 0)
               err = store (pindex);
            else if (s->array)
            {
               nvs_found[(s - revk_settings) / 8] &= ~(1 << ((s - revk_settings) & 7)); // Done here for whole array rather than nvs_erase, as this covers whole array
               for (int i = 0; !err && i < s->array; i++)
                  err = store (i);
            } else
               err = store (-1);
         }
         if (t == JO_NULL)
         {
            if (s->len)
               zapdef ();
            else if (!plen)
            {
               for (s = revk_settings; s->len && (!s->group || s->dot != l || strncmp (s->name, tag, l)); s++);
               if (s->len)
               {                // object reset
                  int group = s->group;
                  for (s = revk_settings; s->len; s++)
                     if (s->group == group)
                        zapdef ();      // Including secrets
               }
            } else
               return "Invalid null";
         } else if (t == JO_OBJECT)
         {                      // Object
            if (plen)
               return "Nested too far";
            if (s->len)
               return "Not an object";
            for (s = revk_settings; s->len && (!s->group || s->dot != l || strncmp (s->name, tag, l)); s++);
            if (!s->len)
               err = "Unknown object";
            else
            {
               int group = s->group;
               err = scan (l, -1);
               if (err)
                  return err;
               t = JO_NULL;     // Set to default
               for (s = revk_settings; s->len; s++)
                  if (s->group == group && !(found[(s - revk_settings) / 8] & (1 << ((s - revk_settings) & 7))) && !s->secret)
                     zapdef (); // Not secrets, D'Oh
            }
         } else if (t == JO_ARRAY)
         {                      // Array
            if (pindex >= 0)
               return "Unexpected nested array";
            if (!s->len)
            {                   // Array of sub objects
               // Find group matching this prefix
               for (s = revk_settings; s->len && (!s->group || s->dot != l || strncmp (s->name, tag, l)); s++);
               if (!s->len)
                  return "Not found object array";
               int group = s->group;
               int index = 0;
               while ((t = jo_next (j)) != JO_CLOSE)
               {
                  if (t == JO_OBJECT)
                  {             // Sub object
                     memset (found, 0, sizeof (found));
                     if ((err = scan (l, index)))
                        return err;
                     t = JO_NULL;       // Set unreferenced to default
                     for (s = revk_settings; s->len; s++)
                        if (s->group == group && !(found[(s - revk_settings) / 8] & (1 << ((s - revk_settings) & 7))))
                           store (index);
                  } else
                     return "Bad array of objects";
                  index++;
               }
               while (1)
               {                // Clean up
                  int found = 0;
                  for (s = revk_settings; s->len; s++)
                     if (s->group == group && s->array > index)
                     {
                        found++;
                        if ((err = store (index)))
                           return err;
                     }
                  if (!found)
                     break;     // Got to end
                  index++;
               }
            } else if (!s->array)
               return "Unexpected array";
            else
            {
               int index = 0;
               while (!err && (t = jo_next (j)) != JO_CLOSE && index < s->array)
               {
                  if ((err = store (index)))
                     return err;
                  index++;
               }
               if (t != JO_CLOSE)
                  return "Too many array entries";
               while (!err && index < s->array)
               {                // NULLs
                  if ((err = store (index)))
                     return err;
                  index++;
               }
            }
         } else if ((err = store (pindex)))
            return err;
      }
      return err;
   }
   err = scan (0, -1);
   if (reload)
      revk_restart ("Settings changed", 5);
   if (locationp)
      *locationp = err ? location : NULL;
   return err ? : change ? "" : NULL;
}

void
revk_settings_commit (void)
{
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
   ESP_LOGE (TAG, "NVC commit");
#endif
   REVK_ERR_CHECK (nvs_commit (nvs[0]));
   REVK_ERR_CHECK (nvs_commit (nvs[1]));
}

revk_settings_t *
revk_settings_find (const char *tag, int *indexp)
{
   revk_settings_t *s = NULL;
   int index = 0;
   if (tag && *tag)
   {
      int l = strlen (tag);
      for (s = revk_settings; s->len && (s->len != l || strcmp (s->name, tag)); s++);
      if (!s->len)
      {
         int e = l;
         while (e && isdigit ((int) tag[e - 1]))
            e--;
         if (e < l)
         {
            for (s = revk_settings; s->len && (!s->array || s->len != e || strncmp (s->name, tag, e)); s++);
            if (!s->len)
               return NULL;
            index = atoi (tag + e) - 1;
            if (index < 0 || index >= s->array)
               return NULL;
         }
      }
   }
   if (indexp)
      *indexp = index;
   return s;
}

int
revk_settings_set (revk_settings_t * s)
{                               // If setting is set (as opposed to default)
   if (!s || !s->len)
      return -1;
   if (s->fix)
      return 2;
   if (nvs_found[(s - revk_settings) / 8] &= ~(1 << ((s - revk_settings) & 7)))
      return 1;
   return 0;
}

#endif
